AevtOdocError = "Some resource files couldn’t be opened.";
AlreadyExistTypeAndID = "There is already a ‘%s’ resource with ID %d. Do you want to replace it or create one with a new ID (unique ID)?";
AlreadyExistingID = "There is already a resource with this ID. Do you want to replace the existing resource or create a new one with a new ID (unique ID)?";
AskRemoveProtectedBit = "This resource is protected. Do you want to remove the protection ? If not, you can remove it later in the Insoector window before saving the resource map.";
BadFontSize = "Bad font size ‘%d’ (must be between 4 and 512 pts).";
CantCreateNewRezFile = "Could not create new resource file (error ‘%d’).";
CantOpenRezFileForWriting = "Could not open resource file for writing (error ‘%d’).";
CantSaveReadOnly = "Can’t save the modifications: document is read only.";
ConfirmCloseModifiedEditedRes = "Some edited resources have not been validated. Do you want to close anyway?";
ConfirmRevert = "OK to revert to the last saved version? All unsaved modifications will be lost.";
CouldNotDeleteExistingFile = "Couln’t delete existing file.";
CouldNotFindTemplates = "Couln’t find the template resources. Edition via templates will not function correctly.";
CouldNotGetTemplateData = "Sorry. Could not get the template’s definition. Please report this problem and use the hexadecimal editor instead.";
CouldNotOpenTemplates = "Couln’t open the template resources. Edition via templates will not function correctly.";
CouldNotSaveEditedRez = "Couln’t save an edited resource. The operation has been cancelled.";
CreateUsingTemplate = "Create resource using ‘%s’ template.";
DataParsingException = "Error while parsing the data. The resource may be corrupted.";
ErrorImportingAeteFromXml = "An error ‘%d’ occured while importing aete date from Xml.";
ErrorInitializingBitmapEditor = "An error occured during the initialization of the bitmap editor. Use the hexadecimal editor instead.";
ErrorInitializingPictureViewer = "An error occured during the initialization of the picture viewer.";
ErrorResizingImage = "This image must be between %ld and %ld pixels.";
ErrorSavingBitmapResource = "An error occured while trying to save the bitmap resource.";
ErrorSavingRezMapDoc = "An error ‘%d’ occured while saving the resource map document.";
ErrorSettingSize = "An error ‘%d’ occured while setting the font size.";
ErrorWhileParsingResource = "An error ‘%d’ occured while parsing the resource.";
ErrorParsingWithTemplate = "An error ‘%d’ occured while parsing the resource with the template. Use the hexadecimal editor instead.";
ErrorWhileSavingTemplateWindow = "An error ‘%d’ occured while saving the template window. The original resource has been left unchanged.";
ErrorWithIconEditor = "An error ‘%d’ occured  within the bitmap editor.";
HaveReadPermission = "Couldn’t save file. Make sure you have ‘read’ permission.";
HaveWritePermission = "Couldn’t save file. Make sure you have ‘write’ permission.";
HexStringMustBeEven = "The number of hexadecimal digits must be even.";
HexStringWrongSize = "Hex string must be ‘%c’ bytes long.";
InvalidHexDataInScrap = "Can’t paste: scrap does not contain valid hexadecimal data.";
InvalidHexDataInString = "This string does not contain valid hexadecimal data.";
MapsNotSelected = "Both resource maps must be selected.";
MenuResourceDeclaresMDEF = "This resource declares a custom MDEF with ID ‘%d’. Rezilla can edit only resources using the standard menu definition. Use the hexadecimal editor instead.";
NewRezMapReplaceExisting = "This will delete the already existing file and replace it by a new one with an empty resource fork. OK to continue?";
NoIDSpecified = "You must specify a resource ID.";
NoOpenWritePermission = "The resource fork of ‘%s’ is already opened with write permission from another application. Try to open it in Read-Only mode.";
NoPictOnClipboard = "No ‘PICT’ resource on the clipboard.";
NoRezInAnyFork = "The file ‘%s’ contains no resources.";
NoRezInDataFork = "The file ‘%s’ contains no resources in the data fork.";
NoRezInRezFork = "The file ‘%s’ contains no resources in the resource fork.";
NoTemplateForThisType = "No template available for ‘%s’ type.";
NoTypeSpecified = "You must specify a resource type.";
OpenForkError = "Error opening resource fork.";
ParseXmnuRezFailed = "The ‘xmnu’ resource corresponding to this ‘MENU’ resource does not have the expected format. Ignoring it.";
PermissionError = "File ‘%s’: access permission error. Maybe the file is in service with another application.";
RequireSystemNine = "Rezilla requires System 9 or greater.";
RequireSystemTen = "Rezilla requires System OSX or greater.";
ResourceExistsWithID = "There is already a resource with ID ‘%d’.";
ResourceLongerThanExpected = "The resource has more data than expected. Edit it with the hexadecimal editor to examine its contents.";
ResourceLongerThanTemplate = "There is more data in the resource than expected by the template’s format. Edit with caution: the extra data will be lost if you validate your changes.";
RezMapAlreadyOpened = "There is already a resource map table opened for this file.";
RezMapsDoNotDiffer = "The resource maps are identical with respect to the comparison criteria.";
RezPickerNotAvailable = "Couldn’t open the resource types picker. Sorry.";
SaveBitmapEditorWindow = "Do you want to save the changes made with the bitmap editor?";
SaveEditedResource = "Do you want to save the changes made in the resource editor?";
SaveHexWindow = "Do you want to save the changes made in the hex editing window?";
SaveModifiedResource = "Do you want to save the changes made in the resource?";
SavePictEditorWindow = "Do you want to save the changes made to this image?";
SaveRezMapWindow = "Do you want to save the resource map before closing?";
SaveTemplateWindow = "Do you want to save the changes made with the template editor?";
SaveTextEditorWindow = "Do you want to save the changes made with the text editor?";
SaveXmnuData = "Some if the data must be stored in an ‘xmnu’ resource otherwise they will be lost. Do you want Rezilla to create this resource?";
SavingResourceFailed = "Saving ‘%s’ resource failed.";
SelectKeyForTemplate = "This resource type can have different formats depending on the value of the property below. Select one of the following values to specify the desired format.";
SolveConflictSimilarlyForNext = "Solve conflict similarly for next resources";
SomeResourcesEditedInOtherMode = "%d resource(s) already edited in another editing mode. Close the corresponding editing window(s) first and try again.";
StringShorterThanRequired = "String must be ‘%c’ bytes long.";
SystemError = "System error ‘%d’";
TemplateParsingException = "The data of this resource do not correspond to the template’s format.";
ThisResourceEditedInOtherMode = "This resource is already edited in another editing mode. Close the corresponding editing window first and try again.";
TypeFieldIsEmpty = "Type can’t be empty: it is a four-chars code.";
UnknownTemplateTag = "Unknown template tag ‘%s’.";
ValidateEditedResBeforeSave = "Some edited resources are modified. Validate or close them before saving the resource map.";
ValidateEditedResBeforeSaveAs = "Some edited resources are modified. Close them before saving the resource map.";
WritePermissionError = "Couldn’t open file with write permission. Do you want to try in read-only access?";
WrongIdForSelectedTemplate = "Given the selected template, the ID for this resource should be ‘%d’. Please fix it otherwise the template editor will fail to open the resource.";
XmnuAlreadyEdited = "The ‘xmnu’ resource corresponding to this ‘MENU’ resource is already edited. Close its editor before.";
XmnuEditedInMenuEditor = "This ‘xmnu’ resource is already edited in the menu editor with its corresponding ‘MENU’ resource.";
